---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentOpenedEventArgs
source: html/0c6c3227-ecad-6a5f-c1b1-d08745360637.htm
---
# Autodesk.Revit.DB.Events.DocumentOpenedEventArgs

The event arguments used by the DocumentOpened event.

## Syntax (C#)
```csharp
public class DocumentOpenedEventArgs : RevitAPIPostDocEventArgs
```